---
title: VoltageType
classe: Autodesk.Revit.DB.Electrical.VoltageType
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# VoltageType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ActualValue { get; }` | `voltageType.ActualValue` | Double |
| `Boolean IsInUse { get; }` | `voltageType.IsInUse` | Boolean |
| `Double MaxValue { get; }` | `voltageType.MaxValue` | Double |
| `Double MinValue { get; }` | `voltageType.MinValue` | Double |
| `Void SetVoltageValue(Double, Double, Double)` | `voltageType.SetVoltageValue(actualValue, minValue, maxValue)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```